import os
from dotenv import load_dotenv

load_dotenv()

DISCORD_KEY = os.getenv("DISCORD_KEY")
GLOBAL_MASSAGE_ON = False
ADMIN = "Руководство проекта"
BOT_VERSION = "build V_1.0"
BOT_CHANNEL = 1472600615606550568
TABLE_CHANNEL = 1524057869274845215
DEPARTMENT_CHANNEL = 1529252684820123738

ROLE_RULES = {
    "Спрайтинг": "Спрайтер",
    "Глава Маппинга": "Маппер",
    "Глава Администрации": "Администратор",
    "Глава Дискорд Модерации": "Дискорд Модератор",
    "Глава Гайдбукинга": "Гайдбукер" "Лоровед",
}

DEPARTMENT_CONFIG = {
    "спрайтинг": {
        "name": "Спрайтинг",
        "titles": ["Младший Спрайтер", "Спрайтер"],
        "base_roles": ["Спрайтинг", "Разработка", "Команда проекта"]
    },
    "маппинг": {
        "name": "Маппинг",
        "titles": ["Младший Маппер", "Маппер"],
        "base_roles": ["Маппинг", "Разработка", "Команда проекта"]
    },
    "администрация": {
        "name": "Администрация",
        "titles": ["Младший Администратор", "Администратор"],
        "base_roles": ["Администрация", "Команда проекта"]
    },
    "разработка": {
        "name": "Разработка",
        "titles": ["Прототипер", "Разработчик"],
        "base_roles": ["Разработка", "Команда проекта"]
    },
    "дискорд модерация": {
        "name": "Дискорд Модерация",
        "titles": ["Дискорд Модератор"],
        "base_roles": ["Дискорд Модерация", "Команда проекта"]
    }
}

